"""이중 배열일 때 set을 이용한 중복 제거"""
a = [[1, 2], [2, 3], [1, 2], [4, 5], [6, 7]]

print(set(a))  # type error

# 안의 배열은 tuple이 됨을 유의할 것
a_copy = list(set(map(tuple, a)))
print(a_copy)  # [(2, 3), (6, 7), (4, 5), (1, 2)]

# 안쪽까지 list로 바꾸기
print(list(map(list, a_copy)))  # [[2, 3], [6, 7], [4, 5], [1, 2]]

# 이중 배열 안 쪽이 tuple이라면 바로 set으로 변환 가능
b = [(1, 2), (2, 3), (1, 2), (4, 5), (6, 7)]

print(list(set(b)))  # [(2, 3), (6, 7), (4, 5), (1, 2)]

# -----------------------------------------------------------------------------------------

""" 데이터 항목을 담는 자료형 """


def list_check(list):
    if list:  # 리스트 안에 데이터가 있는지 확인
        print("자료가 있습니다")
    else:
        print("자료가 없습니다")


list_a = []
list_check(list_a)
list_a.append(1)
list_check(list_a)

# -----------------------------------------------------------------------------------------

""" 이중 배열 값들만 출력하기 """

test_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]

for row in test_list:
    print(row)

# [1, 2, 3]
# [4, 5, 6]
# [7, 8, 9]


for row in test_list:
    print(*row)

# 1, 2, 3
# 4, 5, 6
# 7, 8, 9

# -----------------------------------------------------------------------------------------

"""zip 코드"""
name = ["a", "b"]
value = [1, 2]

# 여러 개의 리스트에서 값을 가져오는 코드
for n, v in zip(name, value):
    print(n, v)

# a, 1
# b, 2

# 같은 열끼리 묶어서 출력
matrix = [[5, 4, 3], [2, 4, 1], [3, 1, 1]]
for m_col in zip(*matrix):
    print(m_col)

# (5, 2, 3)
# (4, 4, 1)
# (3, 1, 1)

# -----------------------------------------------------------------------------------------

"""enumerate: 인덱스와 값을 같이 리턴하는 함수"""
a = ["가", "나", "다"]
for index, value in enumerate(a):
    print(index, value)

# 0 가
# 1 나
# 2 다

# -----------------------------------------------------------------------------------------

"""변수와 리스트 같이 받기"""
num, *arr = list(map(int, input().split()))
print(num)
print(arr)

# 1 2 3 4 5 입력 시

# 1
# [2, 3, 4, 5]

# -----------------------------------------------------------------------------------------

"""행과 열 바꾸기"""
scores = [[10, 20, 30], [60, 70, 90]]
for score in scores:
    print(*score)
# 10 20 30
# 60 70 90

scores = list(map(list, zip(*scores)))
for score in scores:
    print(*score)
# 10 60
# 20 70
# 30 90

# -----------------------------------------------------------------------------------------

"""리스트끼리 합치기"""
a = [[1, 2], [3, 4, 5], [6], [7, 8, 9]]
print(sum(a, []))  # [1, 2, 3, 4, 5, 6, 7, 8, 9]
